In [1]:
#question1
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas', "Elias", 'Myriam'],

'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan , 8, 19, 20, 16],

'attempts': [1, 3, 2, 3, 2, 3, 1, 1, np.nan ,1, 3, 2],

'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no',np.nan , 'yes', 'yes', 'yes']}
labels=pd.Series(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l'])
df=pd.DataFrame(exam_data)
df=df.set_index(labels)
print(df)

        name  score  attempts qualify
a  Anastasia   12.5       1.0     yes
b       Dima    9.0       3.0      no
c  Katherine   16.5       2.0     yes
d      James    NaN       3.0      no
e      Emily    9.0       2.0      no
f    Michael   20.0       3.0     yes
g    Matthew   14.5       1.0     yes
h      Laura    NaN       1.0      no
i      Kevin    8.0       NaN     NaN
j      Jonas   19.0       1.0     yes
k      Elias   20.0       3.0     yes
l     Myriam   16.0       2.0     yes

In [2]:
#question2
df.isnull().sum()

name        0
score       2
attempts    1
qualify     1
dtype: int64

In [3]:
#question3
df["score"]= df["score"].fillna(df["score"].mean())
df

        name  score  attempts qualify
a  Anastasia  12.50       1.0     yes
b       Dima   9.00       3.0      no
c  Katherine  16.50       2.0     yes
d      James  14.45       3.0      no
e      Emily   9.00       2.0      no
f    Michael  20.00       3.0     yes
g    Matthew  14.50       1.0     yes
h      Laura  14.45       1.0      no
i      Kevin   8.00       NaN     NaN
j      Jonas  19.00       1.0     yes
k      Elias  20.00       3.0     yes
l     Myriam  16.00       2.0     yes

In [5]:
df["attempts"]=df["attempts"].fillna(df["attempts"].mode())

In [6]:
df

        name  score  attempts qualify
a  Anastasia  12.50       1.0     yes
b       Dima   9.00       3.0      no
c  Katherine  16.50       2.0     yes
d      James  14.45       3.0      no
e      Emily   9.00       2.0      no
f    Michael  20.00       3.0     yes
g    Matthew  14.50       1.0     yes
h      Laura  14.45       1.0      no
i      Kevin   8.00       NaN     NaN
j      Jonas  19.00       1.0     yes
k      Elias  20.00       3.0     yes
l     Myriam  16.00       2.0     yes

In [7]:
df["qualify"]=df["qualify"].fillna("no")
df

        name  score  attempts qualify
a  Anastasia  12.50       1.0     yes
b       Dima   9.00       3.0      no
c  Katherine  16.50       2.0     yes
d      James  14.45       3.0      no
e      Emily   9.00       2.0      no
f    Michael  20.00       3.0     yes
g    Matthew  14.50       1.0     yes
h      Laura  14.45       1.0      no
i      Kevin   8.00       NaN      no
j      Jonas  19.00       1.0     yes
k      Elias  20.00       3.0     yes
l     Myriam  16.00       2.0     yes

In [11]:
#question4
from sklearn.preprocessing import LabelEncoder
encoder=LabelEncoder()
new_data['qualify']=encoder.fit_transform(new_data['qualify'])
new_data

NameError: name 'new_data' is not defined

In [12]:
one_hot=pd.get_dummies(df["qualify"])
df.drop("qualify", axis=1, inplace=True)
df=df.join(one_hot)
df

        name  score  attempts  no  yes
a  Anastasia  12.50       1.0   0    1
b       Dima   9.00       3.0   1    0
c  Katherine  16.50       2.0   0    1
d      James  14.45       3.0   1    0
e      Emily   9.00       2.0   1    0
f    Michael  20.00       3.0   0    1
g    Matthew  14.50       1.0   0    1
h      Laura  14.45       1.0   1    0
i      Kevin   8.00       NaN   1    0
j      Jonas  19.00       1.0   0    1
k      Elias  20.00       3.0   0    1
l     Myriam  16.00       2.0   0    1